import djn from "../assets/DJN.png";
import dmn from "../assets/DMN.png";
import doImg from "../assets/DO.jpg";
import left from "../assets/left.jpg";
import right from "../assets/right.jpg";
import { Link } from "react-router-dom";
import "./Dobrojanska.css";


export default function Dobrojanska() {
  return (
    <div style={{ padding: "20px", lineHeight: "1.6" }}>
      <h1 className="dobrojanska-title">Добруджанска фолклорна област</h1>
      <img src={doImg} alt="Добруджанска област" className="do-img"/>

        <p className="dob-text">Добруджанската фолклорна област заема североизточната част на България. Границите на областта се очертават по следния начин:</p>

        <ul className="navatre">
            <li>на север - до река Дунав,</li>
            <li>на изток - до Черно море,</li>
            <li>на юг - до Тракийската фолклорна област,</li>
            <li>на запад - до прехода със Северняшката фолклорна област и Лудогорието.</li>
        </ul>
        <p className="dob-text">Обхваща градовете Добрич, Силистра, Балчик, Каварна и Варна.</p>
        <h2 className="dob-zaglavie">Добруджанските танци</h2>

<p className="dob-text">Добруджанските танци са свързани със земеделския труд на нивата и почитта към хляба. Характерни движения са кляканията, „добруджанското навиване“, „ход с подскок“, „причукването“, люшовете, разтърсването на раменете.</p>

<h2 className="dob-zaglavie">Добруджанска фолклорна носия</h2>
<h3 className="nosiq-t">Женска носия</h3>
<ul className="navatre">
  <img src={djn} alt="Добружанска женска носия" className="nosiq-img"/>
    <li>Важна част от облеклото е дълга бяла риза, която е богато украсена с шевици по деколтето и ръкавите. Цветовете на орнаментите обикновено са червено, зелено, синьо и жълто.</li>
    <li>Върху ризата се слага широк и дълъг вълнен сукман с вертикални ивици в по-тъмни или по-ярки нюанси на зелено, синьо, жълто и червено.</li>
    <li>Престилката е украсена с шевици, които контрастират с цветовете на сукмана.</li>
    <li>Коланът е широк и богато украсен с шевици в червено, бяло и черно. </li>
    <li>Завършват традиционната носия с цървулите.</li>
</ul>
<h3 className="nosiq-t">Мъжка носия</h3>
<ul className="navatre">
  <img src={dmn} alt="Добруджанска мъжка носия" className="nosiq-img"/>
    <li>Основен елемент от облеклото е дълга, бяла риза с украшения по деколтето и ръкавите. Шевиците са с геометрични или растителни форми в червено, синьо, зелено и черно.</li>
    <li>Мъжете носят широки потури в тъмни цветове като черно и червени линии.</li>
    <li>Облеклото се допълва с широк червен пояс.</li>
    <li>Елекът, който обличат е без ръкави, тъмни цветове и с шевици.</li>
    <li>Традиционните обувки за областта са цървулите.</li>
    <li>На главата се носи черен или кафяв калпак, направен от вълна и понякога има декоративни елементи.</li>
</ul>

<h2 className="dob-zaglavie">Известни хора</h2>
<p className="dob-text">„Лявата“, „Ръка“, „Сборенка“, „Добруджанска ръченица“, „Опас“, „Данец“, „Куцата“ и „Варненски танц“.</p>

<h2 className="dob-zaglavie">Характерни инструменти</h2>
<p className="dob-text">Характерните инструменти са хармоника, джура гайда и гъдулка (копанка), наричани заедно „добруджанска тройка“, също така кавал, голям дудук и акордеон.</p>
    <div className="dj-button-container">
                <Link to="/" className="dj-button">Начало</Link>
            </div>
            <div className="dc-img">
                <img src={left} alt="Долен ляв ъгъл" className="left-corner" />
                <img src={right} alt="Долен десен ъгъл" className="right-corner" />
            </div>
    </div>
  );
}

