import pjn from "../assets/PJN.png";
import pmn from "../assets/PMN.png";
import po from "../assets/PO.jpg";
import left from "../assets/left.jpg";
import right from "../assets/right.jpg";
import { Link } from "react-router-dom";
import "./Pirinska.css";

export default function Pirinska() {
  return (
    <div className="pirinska-container">
      <h1 className="pirinska-title">Пиринска фолклорна област</h1>
        <img src={po} alt="Пиринска област" className="po-img"/>

      <p className="po-text">Пиринската фолклорна област обхваща югозападната част на България. Границите ѝ се очертават така:</p>
        <ul className="navatre">    
            <li>на север - до Шопската фолклорна област,</li>
            <li>на изток - до Родопите и реките Струма и Места,</li>
            <li>на юг - до Гърция,</li>
            <li>на запад - до Република Северна Македония.</li>
        </ul>
        <p className="po-text">Обхваща градовете Благоевград, Петрич, Сандански, Гоце Делчев и Разлог.</p>

        <h2 className="po-zaglavie">Пирински танци</h2>
        <p className="po-text">Танците в тази фолклорна област са богати и разнообразни. Жените играят под съпровода на песен в умерен ритъм. Хватът е най-често за ръце със свити лакти, а стъпките са бавни, провлачени и придружени с много подскоци и прожинки. Мъжкият танц е характерен с бавното си темпо, което постепенно се забързва. Движенията са с високо вдигнати крака, придружени с леки стъпки, въртения, пружинки и клякания. При мъжете е характерно хвата за рамо.</p>

        <h2 className="po-zaglavie">Пиринска фолклорна носия</h2>
        <h3 className="nosiq">Женска носия</h3>
        <img src={pjn} alt="Пиринска женска носия" className="nosiq-img"/>

        <ul className="navatre">
            <li>Върху бялата риза ясно личат традиционните цветни шевици в червено по деколтето и ръкавите.</li>
            <li>Към основната риза се добавя червен и бежов сукман, като ръкавите са до лактите. В края на ръкавите и деколтето има зелени, златни, червени и жълти линии, по които са втъкани малки червени топчета.</li>
            <li>Престилката е в червено и златно с елементи на ресни, геометрични орнаментите.</li>
            <li>Коланът е червен със златно.</li>
            <li>Младите моми често слагат лента, омъжените - забрадка.</li>
            <li>На краката се носят цървули.</li>
        </ul>

        <h3 className="nosiq">Мъжка носия</h3>
        <img src={pmn} alt="Пиринска мъжка носия" className="nosiq-img"/>
        <ul className="navatre">
            <li>Ризата на мъжете е бяла с малко шевици по деколтето и ръкавите в червено, синьо и черно.</li>
            <li>Една от основните дрехи са бежови потури с лека черна декорация.</li>
            <li>Елекът е изцяло в червено с много елементи на растителни мотиви в черно по шевовете му.</li>
            <li>Поясът е червен, с вертикални и хоризонтални линии в бежово.</li>
            <li>Калпакът е в тъмнокафяв или черен цвят.</li>
            <li>Завършват носията си с цървули на краката.</li>      
        </ul>

        <h2 className="po-zaglavie">Известни хора</h2>
        <p className="po-text">„Джангурица“, „Македонско“, „Ширто“ и „Малешевско“.</p>

        <h2 className="po-zaglavie">Характерни инструменти</h2>
        <p className="po-text">Характерните инструменти в  Пиринската област са тъпан, тамбура (дрънкя) и гайда „джура“, зурна, зилове и овчарска свирка „сворче“. </p>
      <div className="pr-button-container">
                <Link to="/" className="pr-button">Начало</Link>
            </div>
            <div className="pr-img">
                <img src={left} alt="Долен ляв ъгъл" className="p-left" />
                <img src={right} alt="Долен десен ъгъл" className="p-right" />
            </div>
    </div>
  );
}