import sjn from "../assets/SJN.png";
import smn from "../assets/SMN.png";
import so from "../assets/SO.jpg";
import left from "../assets/left.jpg";
import right from "../assets/right.jpg";
import { Link } from "react-router-dom";
import "./Severnyashka.css";

export default function Severnyashka() {
  return (
    <div style={{ lineHeight: "1.6" }}>
      <h1 className="sev-title">Северняшка фолклорна област</h1>
      <img src={so} alt="Северняшка област" className="sev-img"/>

      <p className="sev-text">Северняшка фолклорна област е една от най-големите етнографски области. Географски тя включва две подобласти - Дунавската хълмиста област и Старопланинската област. Границите на областта се очертават по следния начин:</p>
    <ul className="sev-posoki">
      <li>на север - до река Дунав,</li>
      <li>на изток - до Черно море,</li>
      <li>на запад - до Сърбия,</li>
      <li>на юг - до Стара планина.</li>
    </ul>
    <p className="sev-grad">Обхваща Враца, Монтана, Велико Търново, Видин, Лом, Русе и Габрово.</p>

      <h2 className="sev-tanci">Северняшките танци</h2>
      <p className="sev-opisanie">Хората от Северняшката фолклорна област са характерни по външен вид, жизнени и темпераментни. Отличават се с широки движения, скокливост, бързина и специфично провикване. Движенията са съсредоточени в краката и са пружиниращи. В тази област често срещан е хватът с ръцете и свободното му полюшване.</p>

      <h2 className="sev-fn">Северняшка фолклорна носия</h2>
      <h3 className="sev-j-n">Женска носия</h3>
      <img src={sjn} alt="Северняшка женска носия" className="sn-img" />
      <ul className="sev-op">
        <li>Носията е двупрестилчена, с предна и задна престилка.</li> 
        <li>Дълга бяла риза с широки ръкави и с шевици по тях.</li>
        <li>Най-често са в червено, черно, бяло и синьо, с геометрични фигури като ромбове и триъгълници.</li>
        <li>Сукманът е богато украсен с хоризонтални ивици.</li>
        <li>Женската носия включва и престилка с тъмна основа и ярки акценти върху нея.</li>
        <li>Коланът е важна част от носията. Той е широк в червен или тъмен цвят.</li>
        <li>На главата се носи бяла или червена кърпа или венчета.</li>
        <li>Финален акцент в облеклото са цървулите, но се срещат и със скарпини.</li>
      </ul>

      <h3 className="sev-m-n">Мъжка носия</h3>
      <img src={smn} alt="Северняшка мъжка носия" className="sn-img" />
      <ul className="sev-op">
        <li>Дълга риза с права кройка. Семпли шевици по деколтето и ръкавите.</li>
        <li>В мъжкото облекло присъстват бели или бежови потури, които са широки в горната част и по-тесни надолу.</li>
        <li>Черен елек с ярко обшити линии в червено, зелено и бяло.</li>
        <li>Около кръста се увива широк, черен или вълнен пояс, като се среща и в сиво или кафяво.</li>
        <li>Последен щрих към традиционното облекло си обуват цървули.</li>
        <li>Черният калпак допълва характерния облик.</li>
      </ul>

      <h2 className="sev-izvestni">Известни хора</h2>
      <p className="sev-hora">„Дунавско“, „Арканул“, „Ситно Влашко“, „Шира“, „Чичовото“, „Дайчово“, „Еленино“ и „Пайдушко“.</p>

      <h2 className="sev-hi">Характерни инструменти</h2>
      <p className="sev-instr">Дудук, гайда, кавал, гъдулка, овчарска свирка, окарина. Само в тази област се срещат медните духови инструменти като тромпет, валдхорна, туба, тромбон, корнет и еуфониум, но те са характерни при сватби и тържества.</p>
      <div className="sev-button-container">
                <Link to="/" className="sev-button">Начало</Link>
            </div>
            <div className="corner-images">
                <img src={left} alt="Долен ляв ъгъл" className="left" />
                <img src={right} alt="Долен десен ъгъл" className="right" />
            </div>
    </div>
  );
}