import sho from "../assets/SHO.jpg";
import shojn from "../assets/SHOJN.png";
import shomn from "../assets/SHOMN.png";
import left from "../assets/left.jpg";
import right from "../assets/right.jpg";
import { Link } from "react-router-dom";
import "./Shopska.css";

export default function Shopska() {
  return (
    <div style={{ padding: "20px" }}>
      <h1 className="zaglavie">Шопска фолклорна област</h1>
      <img src={sho} alt="Шопска фолклорна област" className="snimka"/>
      <p className="sh-o">Шопската фолклорна област обхваща предимно западната част на България. Границите й се очертават така:</p>
      <ul className="posoki">
        <li>на север - до Стара планина,</li>
        <li>на изток - до Ихтиманските възвишения,</li>
        <li>на запад - до границите на Република Северна Македония и Сърбия,</li>
        <li>на юг - до Осоговска планина и Рила.</li>
      </ul>

    <p className="grad">Градовете, които обхваща Шопската фолклорна област са София, Перник, Самоков, Радомир, Кюстендил.</p>

    <h2 className="dance">Шопски танци</h2>
    <p className="sh-t">Шопските танци се отличават с това, че са бързи и пъргави. Характерно е при тях "натрисане", което представлява треперене на тялото от кръста нагоре с акцент в раменете.</p>
    
    <h2 className="sh-n">Шопска фолклорна носия</h2>
    <h3 className="j-sh-n">Женска носия</h3>
    <img src={shojn} alt="Шопска женска носия" className="shon-img"/>
    <ul className="shoo-title">
        <li>Традиционната носия се отличава с бяла риза, украсена с красиви шевици в синьо, зелено, червено и черно. По краищата на ръкавите и в долната част на ризата се забелязва фина дантела.</li>
        <li>Един от най-видимите елементи е сукманът, който е в син цвят с елементи в бял и червен цвят.</li>
        <li>Около кръста се носи колан, който е бял с червени линии като е леко отпуснат и отпред висят червени пискюли с топчета.</li>
        <li>Жените носят кърпа, която е червена.</li>
        <li>Традиционните обувки са цървули.</li>
    </ul>

    <h3 className="sho-title">Мъжка носия</h3>
    <img src={shomn} alt="Шопска мъжка носия" className="shon-img"/>
    <ul className="shoo-title">
        <li>Ризата е бяла с много шевици в червено, зелено, синьо и черно.</li>
        <li>Традиционното мъжко облекло включва потури, които са изчистени в бежов цвят.</li>
        <li>Елекът е в син цвят с бели елементи по него като е съобразен със стила на женската носия.</li>
        <li>Облеклото се пристяга с червен и широк пояс.</li>
        <li>Част от традиционния облик е калпакът, който може да е черен или бял.</li>
        <li>Цървулите допълват цялостния вид.</li>
    </ul>

    <h2 className="shoh">Известни хора</h2>
    <p className="hh">Традиционните хора в Шопската област са "Шопско хоро", "Граовско хоро", "Четворно хоро", "Кюстендилски ръченици" и "Касапско хоро".</p>

    <h2 className="shohi">Характерни инструменти</h2>
    <p className="instr">Емблематичните инструменти са гъдулка, гайда, дудук, кавал, тамбура и тъпан.</p>
    <div className="sh-button-container">
      <Link to="/" className="sh-button">Начало</Link>
    </div>
    <div className="sh-images">
        <img src={left} alt="Долен ляв ъгъл" className="sh-left" />
        <img src={right} alt="Долен десен ъгъл" className="sh-right" />
      </div>    
    </div>
  );
}
