import tjn from "../assets/TJN.png";
import tmn from "../assets/TMN.png";
import to from "../assets/TO.jpg";
import left from "../assets/left.jpg";
import right from "../assets/right.jpg";
import { Link } from "react-router-dom";
import "./Trakiiska.css";

export default function Trakiiska() {
    return (
        <div style={{ padding: "20px", lineHeight: "1.6" }}>
            <h1 className="trakiiska-title">Тракийска фолклорна област</h1>
            <img src={to} alt="Тракийска област" className="tr-img"/>
            <p className="trakiiska-text">Тракийската фолклорна област се разделя на три района – западнотракийски, източнотракийски и странджански. Границите  й се очертават така:</p>
            <ul className="r-t">
                <li>на север - до южните склонове на Стара планина и Средна гора,</li>
                <li>на изток - до Черно море и района на Странджа,</li>
                <li>на запад - до Средногорието,</li>
                <li>на юг - до границите с Турция и Гърция.</li>
            </ul>
            
            <p className="cities">Градовете, които обхваща са Стара Загора, Димитровград, Гълъбово, Ямбол, Хасково, Нова Загора, Пловдив, Сливен и Пазарджик.</p>
            
            <h2 className="section">Тракийски танци</h2>
            <p className="tanci">Танцът на тракиеца е улегнал и спокоен, стъпил здраво на земята, показвайки самочувствието на стопанин на плодородната низина, а тракийката стъпва ситно и пъргаво, с лекота и внимание следвайки го.</p>
            <h2 className="z">Тракийска фолклорна носия</h2>
            <h3 className="nos">Женска носия</h3>
            <ul className="nn">
                <img src={tjn} alt="Тракийска женска носия" className="tn-img"/>
                <li>Основен елемент от носията е дълга, бяла риза с шевици по ръкавите и деколтето в зелено и черно.</li>
                <li>Характерен за облеклото е зеленият сукман с орнаменти в оранжево и по-светло зелено.</li>
                <li>Престилката е в бежов цвят с елементи в розово, зелено, оранжево и синьо, приличащи на цветя.</li>
                <li>Облеклото се допълва от оранжев колан с пафти, а на деколтето се слага гердан с монети.</li>
                <li>За завършек на облеклото си обуват скарпини.</li>
                <li>Младите моми носят венче на главата, а омъжените – червена кърпа.</li>
            </ul>
            <h3 className="nos">Мъжка носия</h3>
            <ul className="nn">
                <img src={tmn} alt="Тракийска мъжка носия" className="tn-img"/>
                <li>Важна част от облеклото е бяла риза с шевици по ръкавите и деколтето в червени, сини, зелени и черни цветове.</li>
                <li>Потурите са в тъмнокафяв цвят с лека украса в черно отстрани.</li>
                <li>Цветовете на елека са черно и червено, като по него има черен гайтан.</li>
                <li>Носията се допълва с червен пояс, увит около кръста.</li>
                <li>Традиционните обувки са скарпини.</li>
                <li>За пълния и завършен облик на носията слагат черен калпак.</li>
            </ul>
            <h2 className="it">Известни хора</h2>
            <p className="horo">„Право тракийско хоро“, „Бучимиш“, „Пазарджишка Копаница“, „Тракийска ръченица“, „Трите пъти“, „Джиновско“. Специфични за района са нестинарските обредни танци и кукерските маскаради.</p>

            <h2 className="hi">Характерни инструменти</h2>
            <p className="thi">Характерните инструменти  за Тракийската фолклорна област са кавал, гайда, тъпан и гъдулка.</p>
            <div className="tr-button-container">
                <Link to="/" className="tr-button">Начало</Link>
            </div>
            <div className="corner-img">
                <img src={left} alt="Долен ляв ъгъл" className="t-left" />
                <img src={right} alt="Долен десен ъгъл" className="t-right" />
            </div>
        </div>
    );
}
