import React, { useEffect, useRef } from "react";
import { useNavigate } from "react-router-dom";
import imageMapResize from "image-map-resizer";
import "./Map.css";
import mapImage from "../assets/MapBG.jpg";

export default function Map() {
    const navigate = useNavigate();
    const imgRef = useRef(null);

    useEffect(() => {
        imageMapResize();
    }, []);

    return(
        <div className="map-container">
            <img
            ref={imgRef}
            src={mapImage}
            useMap="#bg-map"
            alt="Карта на България"
            className="map-img"
            />

                        <map name="bg-map">
                            <area 
                            shape="poly" 
                            coords="654,102,697,128,723,154,772,193,831,207,963,200,974,170,992,176,1002,161,1029,164,1030,151,1045,130,1030,90,990,99,949,91,928,87,916,63,904,59,885,67,873,59,864,63,819,55,814,44,805,47,765,53,743,59,737,66,705,68,685,75,670,84" 
                            href="/dobrojanska" 
                            alt="Добруджанска фолклорна област" 
                            title="Добруджанска фолклорна област"
                            onClick={(e) => { e.preventDefault(); navigate('/dobrojanska'); }}
                            />

                            <area
                                shape="poly"
                                coords="128,305,293,422,295,483,274,506,254,515,233,525,186,543,148,543,135,551,124,561,113,572,85,567,51,515,68,479,54,447,52,420,52,405,55,385,83,377,93,342"
                                alt="Шопска фолклорна област"
                                title="Шопска фолклорна област"
                                href="/shopska"
                                onClick={(e) => { e.preventDefault(); navigate('/shopska'); }}
                            />

                            <area 
                            shape="poly" 
                            coords="113,575,140,547,188,539,214,535,246,517,273,511,277,519,288,556,296,581,317,623,329,647,350,667,326,704,305,701,275,715,248,725,225,728,197,727,181,747,141,748,137,706,137,652,141,632,126,617" 
                            href="/pirinska" 
                            alt="Пиринска фолклорна област"
                            title="Пиринска фолклорна област"
                            onClick={(e) => { e.preventDefault(); navigate('/pirinska'); }}
                            />

                            <area 
                            shape="poly" 
                            coords="277,511,293,574,335,655,373,676,397,669,413,661,421,664,438,691,453,689,471,703,494,693,535,701,574,727,593,719,619,702,660,692,686,687,722,679,739,650,737,608,682,619,648,617,620,615,598,603,548,587,486,559,439,562,395,565,353,547,323,526" 
                            href="/rodopska" 
                            alt="Родопска фолклорна област" 
                            title="Родопска фолклорна област"
                            onClick={(e) => { e.preventDefault(); navigate('/rodopska'); }}
                            />

                            <area 
                            shape="poly" 
                            coords="295,419,300,448,296,474,291,509,308,518,336,534,378,559,424,564,476,555,512,570,581,593,628,615,683,618,733,607,721,589,728,578,744,579,754,568,761,551,773,549,793,546,795,515,821,506,838,505,849,489,867,474,882,471,923,483,952,494,970,477,996,480,1019,461,970,426,961,397,945,380,912,385,906,379,905,365,911,367,919,359,934,344,940,335,958,319,890,295,830,287,785,291,746,299,696,319,648,339,597,358,527,375,416,391,349,407" 
                            href="/trakiiska" 
                            alt="Тракийска фолклорна област"
                            title="Тракийска фолклорна област" 
                            onClick={(e) => { e.preventDefault(); navigate('/trakiiska'); }}
                            />

                            <area 
                            shape="poly" 
                            coords="61,73,63,102,58,116,34,135,31,165,51,239,85,253,95,278,124,297,177,331,289,416,480,384,638,343,777,294,861,288,912,301,965,319,953,219,962,199,877,210,820,207,765,187,731,159,707,139,650,105,609,137,577,171,515,177,472,156,406,154,331,158,203,147,117,162,97,138,125,98" 
                            href="/severnyashka" 
                            alt="Северняшка фолклорна област" 
                            title="Северняшка фолклорна област"
                            onClick={(e) => { e.preventDefault(); navigate('/severnyashka'); }}
                            />
                        </map>
        </div>
    )
}